novaeco/A.R.S/sdkconfig.defaults
# =============================================================================
# ESP-IDF / LVGL / A.R.S Project Configuration Defaults
# =============================================================================
# Ce fichier définit les valeurs par défaut pour la configuration du projet.
# Après modification, exécuter: idf.py set-target esp32s3 && idf.py fullclean build
# =============================================================================

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- PSRAM (critical for RGB framebuffers) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# --- Cache Configuration (CRITICAL: 64B cache line required for bounce buffer) ---
# Source: https://docs.espressif.com/projects/esp-faq/en/latest/software-framework/peripherals/lcd.html
# "When using PSRAM and Bounce buffer, please configure the Data cache line size to 64 Bytes"
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# --- VSYNC Synchronization (FIX A: Enable VSYNC to prevent tearing) ---
CONFIG_ARS_LCD_VSYNC_WAIT_ENABLE=y
CONFIG_ARS_LCD_WAIT_VSYNC=y
CONFIG_ARS_LCD_WAIT_VSYNC_TIMEOUT_MS=80

# --- LCD RGB Panel (ST7262 RGB 1024x600) ---
# Datasheet ST7262 (7.3.4 Parallel 24-bit RGB Timing): typ H/V porch=8/8, pulse=4.
# With Htotal=1044 and Vtotal=620, a 40 MHz PCLK yields ~61.7 Hz refresh.
CONFIG_ARS_LCD_PCLK_HZ=22000000
# Bounce buffer: 20 lines to keep DMA bursts stable at higher PCLK.
CONFIG_ARS_LCD_BOUNCE_BUFFER_LINES=30
CONFIG_ARS_LCD_PCLK_ACTIVE_NEG=y

# --- LVGL Task ---
CONFIG_ARS_LVGL_TASK_CORE=0
CONFIG_ARS_LVGL_TASK_PRIO=5
CONFIG_ARS_LVGL_TASK_STACK=8192
CONFIG_ARS_LVGL_BUF_LINES=80
CONFIG_ARS_LVGL_COLOR_DEPTH=16

# --- Touch Orientation Defaults ---
CONFIG_ARS_TOUCH_SWAP_XY=n
CONFIG_ARS_TOUCH_MIRROR_X=y
CONFIG_ARS_TOUCH_MIRROR_Y=y

# --- LVGL Fonts ---
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
# --- Task Watchdog ---
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# --- FreeRTOS ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=2048

# --- I2C Deprecation Suppress ---
CONFIG_I2C_SUPPRESS_DEPRECATE_WARN=y
CONFIG_ARS_IOEXT_SCL_SPEED_HZ=100000

# --- SD Ext-CS Robustesse (diagnostic par défaut) ---
CONFIG_ARS_SD_EXTCS_CS_READBACK=n
CONFIG_ARS_SD_DIAG_VERBOSE=n
CONFIG_ARS_SD_PAUSE_TOUCH_DURING_SD_INIT=y

# --- Logging + Console ---
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL=3
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
